app/views/concessions/index.html.erb

SELECT "concessions".* FROM "concessions"
SELECT SUM("concessions"."bags_received_empty") AS sum_id FROM "concessions"
---

                                            'bags_received_empty'=>Concession.sum("bags_received_empty"),
                      'transport_expense'=>Concession.sum("transport_expense")}-->