app/controllers/concessions_controller.rb

  def index
    @concessions = Concession.all
    @data = []
    count = 0
    td_class = ['choiceA','choiceB','choiceC','choiceD','choiceE','choiceF on']
    @concessions.each do |concession|
      @record     = {
                      'td_class'=>td_class[count],
                      'concession_id'=>concession.concession_id,
                      'name'=>concession.name,
                      'quantity_planned'=>concession.quantity_planned,
                      'quantity_procured'=>concession.quantity_procured,
                      'weight_loss'=>concession.weight_loss,
                      'input_delivered'=>concession.input_delivered,
                      'input_recovered'=>concession.input_recovered,
                      'input_non_recovery'=>concession.input_non_recovery,
                      'jute_bags_given'=>concession.jute_bags_given,
                      'bags_received'=>concession.bags_received,
                      'bags_received_empty'=>concession.bags_received_empty,
                      'transport_expense'=>concession.transport_expense,
                      'cash_balance'=>concession.cash_balance}
     @data[count]=@record
     count = count + 1
    end
    @record     = {
                      'td_class'=>td_class[count],
                      'name'=>"Total",
                      'quantity_planned'=>Concession.sum("quantity_planned"),
                      'quantity_procured'=>Concession.sum("quantity_procured"),
                      'weight_loss'=>Concession.sum("weight_loss"),
                      'input_delivered'=>Concession.sum("input_delivered"),
                      'input_recovered'=>Concession.sum("input_recovered"),
                      'input_non_recovery'=>Concession.sum("input_non_recovery"),
                      'jute_bags_given'=>Concession.sum("jute_bags_given"),
                      'bags_received'=>Concession.sum("bags_received"),
                      'bags_received_empty'=>Concession.sum("bags_received_empty"),
                      'transport_expense'=>Concession.sum("transport_expense"),
                      'cash_balance'=>Concession.sum("cash_balance")}
---
SELECT "concessions".* FROM "concessions"
SELECT SUM("concessions"."bags_received_empty") AS sum_id FROM "concessions"